Revit 2027 API
RoofComponents.GetAreasOfCurveLoops Method
 The areas of CurveLoops of roof slabs.
Namespace: Autodesk.Revit.DB.IFC
Assembly: RevitAPIIFC (in RevitAPIIFC.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public IList<double> GetAreasOfCurveLoops()
Public Function GetAreasOfCurveLoops As IList(Of Double)
public:
IList<double>^ GetAreasOfCurveLoops()
member GetAreasOfCurveLoops : unit -> IList<float>
Return Value
IList<Double>
See Also
Reference
RoofComponents Class
Autodesk.Revit.DB.IFC Namespace